app/controllers/artists_controller.rb

  def index
    if params[:song_id]
      @artists = Artist.find(params[:song_id]).songs
    else
      @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def show
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]